/* 存放机场城市数据 */
const cities = [
  [
    [],
    ['北京', '上海', '广州', '深圳', '成都', '杭州', '武汉', '西安', '重庆', '青岛', '长沙', '南京', '厦门', '昆明', '大连', '天津', '郑州', '三亚', '济南', '福州']
  ]
]

const cityArray = [
  [
    [
      [],
      ['北京', '上海', '广州', '深圳', '成都', '杭州', '武汉', '西安', '重庆', '青岛', '长沙', '南京', '厦门', '昆明', '大连', '天津', '郑州', '三亚', '济南', '福州']
    ]
  ], // 热门城市
  [
    [
      ['A'],
      ['阿勒泰', '阿克苏', '鞍山', '安庆', '安顺', '阿拉善左', '中国澳门', '阿里', '阿拉善右', '阿尔山']
    ], // ABCDEF的城市
    [
      ['B'],
      ['巴中', '百色', '包头', '毕节', '北海', '北京', '博乐', '保山', '白城', '布尔津', '白山', '巴彦淖尔']
    ],
    [
      ['C'],
      ['昌都', '承德', '常德', '长春', '朝阳', '赤峰', '长治', '重庆', '长沙', '成都', '沧源', '常州', '池州']
    ],
    [
      ['D'],
      ['大同', '达州', '稻城', '丹东', '迪庆', '大连', '大理', '敦煌', '东营', '大庆', '德令哈']
    ],
    [
      ['E'],
      ['鄂尔多斯', '额济纳旗', '恩施', '二连浩特']
    ],
    [
      ['F'],
      ['福州', '阜阳', '抚远', '富蕴', '佛山']
    ]
  ],
  [
    [
      ['G'],
      ['广州', '果洛格尔木', '广元', '固原', '中国高雄', '赣州', '贵阳', '桂林']
    ], // GHIJ的城市
    [
      ['H'],
      ['红原', '海口', '河池', '邯郸', '黑河', '呼和浩特', '合肥', '杭州', '淮安', '怀化', '海拉尔', '哈密', '衡阳', '哈尔滨', '和田', '花土沟', '中国花莲', '霍林郭勒', '惠州', '汉中', '黄山', '呼伦贝尔', '菏泽']
    ],
    [
      ['J'],
      ['中国嘉义', '景德镇', '加格达奇', '嘉峪关', '井冈山', '金昌', '九江', '荆门', '佳木斯', '济宁', '锦州', '建三江', '鸡西', '九寨沟', '中国金门', '揭阳', '济南', '荆州']
    ]
  ],
  [
    [
      ['K'],
      ['库车', '康定', '喀什凯里', '昆明', '库尔勒', '克拉玛依']
    ], // KLMN城市
    [
      ['L'],
      ['黎平', '澜沧', '龙岩', '临汾', '兰州', '丽江', '荔波', '吕梁', '临沧', '陇南', '六盘水', '拉萨', '洛阳', '连云港', '临沂', '柳州', '泸州', '林芝']
    ],
    [
      ['M'],
      ['芒市', '牡丹江', '中国马祖', '绵阳', '梅州', '中国马公', '满洲里', '漠河']
    ],
    [
      ['N'],
      ['南昌', '中国南竿', '南充', '宁波', '南京', '宁蒗', '南宁', '南阳', '南通']
    ]
  ],
  [
    [
      ['P'],
      ['攀枝花', '普洱']
    ], // PQRSTW城市
    [
      ['Q'],
      ['琼海', '秦皇岛', '祁连', '且末', '庆阳', '黔江', '泉州', '衢州', '齐齐哈尔', '青岛']
    ],
    [
      ['R'],
      ['日照', '日喀则', '若羌']
    ],
    [
      ['S'],
      ['神农架', '莎车', '上海', '沈阳', '石河子', '石家庄', '上饶', '三明', '三亚', '深圳', '十堰', '邵阳', '松原']
    ],
    [
      ['T'],
      ['台州', '中国台中', '塔城', '腾冲', '铜仁', '通辽', '天水', '吐鲁番', '通化', '中国台南', '中国台北', '天津', '中国台东', '唐山', '太原']
    ],
    [
      ['w'],
      ['五大连池', '乌兰浩特', '乌兰察布', '乌鲁木齐', '潍坊', '威海', '文山', '温州', '乌海', '武汉', '武夷山', '无锡', '梧州', '万州', '乌拉特中', '巫山', '武隆', '芜湖']
    ]
  ],
  [
    [
      ['X'],
      ['兴义', '夏河', '中国香港', '西双版纳', '新源', '西安', '忻州', '信阳', '襄阳', '西昌', '锡林浩特', '厦门', '西宁', '徐州']
    ], // XYZ的城市
    [
      ['Y'],
      ['延安', '银川', '伊春', '永州', '榆林', '宜宾', '运城', '宜春', '宜昌', '伊宁', '义乌', '营口', '延吉', '烟台', '盐城', '扬州', '玉树', '玉林', '岳阳']
    ],
    [
      ['Z'],
      ['郑州', '张家界', '舟山', '扎兰屯', '张掖', '昭通', '湛江', '中卫', '张家口', '珠海', '遵义']
    ]
  ]
]

const allCity = [
  '阿勒泰', '阿克苏', '鞍山', '安庆', '安顺', '阿拉善左', '中国澳门', '阿里', '阿拉善右', '阿尔山',
  '巴中', '百色', '包头', '毕节', '北海', '北京', '博乐', '保山', '白城', '布尔津', '白山', '巴彦淖尔',
  '昌都', '承德', '常德', '长春', '朝阳', '赤峰', '长治', '重庆', '长沙', '成都', '沧源', '常州', '池州',
  '大同', '达州', '稻城', '丹东', '迪庆', '大连', '大理', '敦煌', '东营', '大庆', '德令哈',
  '鄂尔多斯', '额济纳旗', '恩施', '二连浩特',
  '福州', '阜阳', '抚远', '富蕴', '佛山',
  '广州', '果洛格尔木', '广元', '固原', '中国高雄', '赣州', '贵阳', '桂林',
  '红原', '海口', '河池', '邯郸', '黑河', '呼和浩特', '合肥', '杭州', '淮安', '怀化', '海拉尔', '哈密', '衡阳', '哈尔滨', '和田', '花土沟', '中国花莲', '霍林郭勒', '惠州', '汉中', '黄山', '呼伦贝尔', '菏泽',
  '中国嘉义', '景德镇', '加格达奇', '嘉峪关', '井冈山', '金昌', '九江', '荆门', '佳木斯', '济宁', '锦州', '建三江', '鸡西', '九寨沟', '中国金门', '揭阳', '济南', '荆州',
  '库车', '康定', '喀什凯里', '昆明', '库尔勒', '克拉玛依',
  '黎平', '澜沧', '龙岩', '临汾', '兰州', '丽江', '荔波', '吕梁', '临沧', '陇南', '六盘水', '拉萨', '洛阳', '连云港', '临沂', '柳州', '泸州', '林芝',
  '芒市', '牡丹江', '中国马祖', '绵阳', '梅州', '中国马公', '满洲里', '漠河',
  '南昌', '中国南竿', '南充', '宁波', '南京', '宁蒗', '南宁', '南阳', '南通',
  '攀枝花', '普洱',
  '琼海', '秦皇岛', '祁连', '且末', '庆阳', '黔江', '泉州', '衢州', '齐齐哈尔', '青岛',
  '日照', '日喀则', '若羌',
  '神农架', '莎车', '上海', '沈阳', '石河子', '石家庄', '上饶', '三明', '三亚', '深圳', '十堰', '邵阳', '松原',
  '台州', '中国台中', '塔城', '腾冲', '铜仁', '通辽', '天水', '吐鲁番', '通化', '中国台南', '中国台北', '天津', '中国台东', '唐山', '太原',
  '五大连池', '乌兰浩特', '乌兰察布', '乌鲁木齐', '潍坊', '威海', '文山', '温州', '乌海', '武汉', '武夷山', '无锡', '梧州', '万州', '乌拉特中', '巫山', '武隆', '芜湖',
  '兴义', '夏河', '中国香港', '西双版纳', '新源', '西安', '忻州', '信阳', '襄阳', '西昌', '锡林浩特', '厦门', '西宁', '徐州',
  '延安', '银川', '伊春', '永州', '榆林', '宜宾', '运城', '宜春', '宜昌', '伊宁', '义乌', '营口', '延吉', '烟台', '盐城', '扬州', '玉树', '玉林', '岳阳',
  '郑州', '张家界', '舟山', '扎兰屯', '张掖', '昭通', '湛江', '中卫', '张家口', '珠海', '遵义'
]

export default {
  cities,
  cityArray,
  allCity
}
